<a href="https://colab.research.google.com/github/Oreoluwa99/demo_test/blob/main/Combining_Data_Accross_Rows_and_Columns.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:
data_dict1 = {'name': ['Ibrahim Musa', 'Emeka Jude', 'Emmanuel Ayomide'],
              'Age': [24,25,27],
              'Sport': ['Football', 'Basketball', 'Volleyball']}

In [3]:
data_dict1

{'Age': [24, 25, 27],
 'Sport': ['Football', 'Basketball', 'Volleyball'],
 'name': ['Ibrahim Musa', 'Emeka Jude', 'Emmanuel Ayomide']}

In [4]:
data_dict2 = {'name': ['Nnamdi Ike', 'Emmanuel Ayomide', 'Ahmed Musa'],
              'Age': [24, 27, 28],
              'SPort': ['Football', 'Volleyball', 'Swimming']}

In [10]:
df1 = pd.DataFrame(data_dict1, index=[0,1,2])

In [11]:
df1

               name  Age       Sport
0      Ibrahim Musa   24    Football
1        Emeka Jude   25  Basketball
2  Emmanuel Ayomide   27  Volleyball

In [13]:
df2 = pd.DataFrame(data_dict2, index=[3,2,5])

In [14]:
df2

               name  Age       SPort
3        Nnamdi Ike   24    Football
2  Emmanuel Ayomide   27  Volleyball
5        Ahmed Musa   28    Swimming

In [15]:
pd.concat([df1, df2])

               name  Age       Sport       SPort
0      Ibrahim Musa   24    Football         NaN
1        Emeka Jude   25  Basketball         NaN
2  Emmanuel Ayomide   27  Volleyball         NaN
3        Nnamdi Ike   24         NaN    Football
2  Emmanuel Ayomide   27         NaN  Volleyball
5        Ahmed Musa   28         NaN    Swimming

In [16]:
df1.append(df2)

               name  Age       Sport       SPort
0      Ibrahim Musa   24    Football         NaN
1        Emeka Jude   25  Basketball         NaN
2  Emmanuel Ayomide   27  Volleyball         NaN
3        Nnamdi Ike   24         NaN    Football
2  Emmanuel Ayomide   27         NaN  Volleyball
5        Ahmed Musa   28         NaN    Swimming

In [24]:
pd.concat([df1, df2], axis=1)

               name   Age       Sport              name   Age       SPort
0      Ibrahim Musa  24.0    Football               NaN   NaN         NaN
1        Emeka Jude  25.0  Basketball               NaN   NaN         NaN
2  Emmanuel Ayomide  27.0  Volleyball  Emmanuel Ayomide  27.0  Volleyball
3               NaN   NaN         NaN        Nnamdi Ike  24.0    Football
5               NaN   NaN         NaN        Ahmed Musa  28.0    Swimming

In [25]:
pd.concat([df1, df2], axis=1, join='outer')

               name   Age       Sport              name   Age       SPort
0      Ibrahim Musa  24.0    Football               NaN   NaN         NaN
1        Emeka Jude  25.0  Basketball               NaN   NaN         NaN
2  Emmanuel Ayomide  27.0  Volleyball  Emmanuel Ayomide  27.0  Volleyball
3               NaN   NaN         NaN        Nnamdi Ike  24.0    Football
5               NaN   NaN         NaN        Ahmed Musa  28.0    Swimming

In [26]:
pd.concat([df1, df2], axis=1, join='inner')

               name  Age       Sport              name  Age       SPort
2  Emmanuel Ayomide   27  Volleyball  Emmanuel Ayomide   27  Volleyball

In [28]:
#This uses group keys to separate the tables together
dff = pd.concat([df1, df2], keys=['X', 'Y'])

In [29]:
dff

                 name  Age       Sport       SPort
X 0      Ibrahim Musa   24    Football         NaN
  1        Emeka Jude   25  Basketball         NaN
  2  Emmanuel Ayomide   27  Volleyball         NaN
Y 3        Nnamdi Ike   24         NaN    Football
  2  Emmanuel Ayomide   27         NaN  Volleyball
  5        Ahmed Musa   28         NaN    Swimming

In [31]:
dff.loc['X']

               name  Age       Sport SPort
0      Ibrahim Musa   24    Football   NaN
1        Emeka Jude   25  Basketball   NaN
2  Emmanuel Ayomide   27  Volleyball   NaN

In [32]:
dff.loc['Y']

               name  Age Sport       SPort
3        Nnamdi Ike   24   NaN    Football
2  Emmanuel Ayomide   27   NaN  Volleyball
5        Ahmed Musa   28   NaN    Swimming

Combining Data on a Common Index